simulacoes/bump/rhoPimpleFoam/tranSonico/upwind/128x35/sim3/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;

    limited         cellLimited Gauss linear 1;
    grad(U)         $limited;
}

divSchemes
{
    default                         none;
    div(phi,U)                      Gauss linearUpwind limited;
    
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phid,p)     Gauss upwind;
    div(phi,e)      Gauss linearUpwind limited;
    div(phi,K)      Gauss linearUpwind limited;
    div(phiv,p)     Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
