simulacoes/bump/rhoPimpleFoam/tranSonico/upwind/128x35/sim3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(rho|U|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }
    
    "(rho|U|e)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors     2;
    nCorrectors          10;
    nNonOrthogonalCorrectors 0;
}

//relaxationFactors
//{
//    fields
//    {
//        p               0.3;
//        rho             0.01; //0.01
//    }
//    equations
//    {
//        U               0.7;
//        e               0.7;
//    }
//}

// ************************************************************************* //
